[
  {
    "createdAt": "Posted few hours ago",
    "title": "Programme Coordinator",
    "location": "Auckland CBD, Auckland, New Zealand",
    "workStyle": "On-site",
    "workType": "Full time",
    "url": "https://apply.workable.com/connexa/j/5B3525D7E9/",
    "areas": "Operations",
    "description": "Description\n\nConnexa is New Zealand’s largest mobile towers and passive infrastructure business, operating a nationwide portfolio of over 2,350 mobile sites. Connexa's vision is to enable a more connected digital future for Aotearoa New Zealand.\n\nAs the Programme Coordinator you will provide support to our Programme Director and PMO in the planning, coordination, and execution of site build and upgrade projects across Connexa. You will play a crucial role in ensuring projects are delivered on time, within budget, and meet the desired objectives.\n\nYou’ll be joining a fast-growing team in a newly established company where you’ll be a part of our journey, shaping the ways of working and co-creating the culture\n\nKey Responsibilities include:\n\nSupport Programme Director with project set up\nCoordinate programme activities and track progress to ensure timely completion\nCollaborate with cross-functional teams to requirements and ensure alignment\nCreate, manage & optimise programme documentation, including meeting minutes, progress reports, and change requests, governance reporting\nAssist with programme financial reporting\nAssist in risk identification, tracking and mitigation strategies\nSupport Programme Director & team in stakeholder management and communication\nContribute to the continuous improvement of processes and tools within Connexa\nFacilitation of weekly end to end meetings and change request forums"
  },
  {
    "createdAt": "Posted 22 days ago",
    "title": "Deployment Engineer",
    "location": "Auckland CBD, Auckland, New Zealand",
    "workStyle": "On-site",
    "workType": "Full time",
    "url": "https://apply.workable.com/connexa/j/5446917DA3/",
    "areas": "Operations",
    "description": "Description\n\nAt Connexa we design, build and operate the country’s most comprehensive mobile tower infrastructure network. Why? To help unleash the power of connectivity for everyone who has increasing demands and reliance on digital connectivity to live, work and play.\n\nAs the Deployment Engineer you’ll be building relationships with vendors, suppliers, and service companies to plan, design and deliver telecommunications infrastructure that meets customer technical specifications within budget and delivery timeframes.\n\nKey Responsibilities include:\n\nPrepare and interpret specifications, drawings, and regulations for the passive infrastructure build\nProduce ‘bill of materials’ for the project based on design requirements and providing a future forecast\nDevelop concept design, plan and track progress\nProvide technical input into the design and delivery of the project\nWorking collaboratively with property, engineering, and delivery colleagues, supporting successful project delivery end to end\nLiaise and coordinate with vendors to ensure timely and efficient build completion\nManage sub-contracting partners to improve delivery and business flexibility\nAdhere to relevant NZ compliance standards and Connexa Workplace Health & Safety policies\nParticipate in technical information sharing forums to represent Connexa"
  },
  {
    "createdAt": "Posted 23 days ago",
    "title": "Head of Finance",
    "location": "Auckland CBD, Auckland, New Zealand",
    "workStyle": "On-site",
    "workType": "Full time",
    "url": "https://apply.workable.com/connexa/j/F14939CCF3/",
    "areas": "Corporate",
    "description": "Description\n\nAt Connexa we design, build and operate the country’s most comprehensive mobile tower infrastructure network. Why? To help unleash the power of connectivity for everyone who has increasing demands and reliance on digital connectivity to live, work and play.\n\nWe are a new industry sector in New Zealand that has gone through exponential growth in the last 12 months including implementation of a new FMIS system.  You will be coming into an environment that is fast paced, ensuring that we streamline process and focus on continuous improvement so we can meet our ambitious build outcomes.\n\nIf you are an ambitious finance leader who would like to take ownership of a full finance function, then this role could be for you! The breadth of the role means that you may not be an expert across all areas of responsibility however, deep experience in finance functions, an aptitude for learning and the ability to get stuck in will enable significant growth in a supportive environment. \n\nYou will be leading the Finance function creating clear vision & leadership for the small but very capable team.  You will have full responsibility for all aspects of the finance function and environment, including financial and management accounting, business partnering, treasury, financial analysis, and support for commercial decisions.\n\nResponsibilities include:\n\nLeading a highly effective team, focused on achieving excellence across the function and providing growth opportunities for individuals in the team\nPreparing accurate and timely financial information including reporting, forecasts, and budgets\nLeadership in the areas of technical accounting, tax, treasury and valuations, including managing relationships with external auditors, tax advisors, and financial institutions\nOwnership of financial systems and operations, ensuring adequate controls and in place to ensure all aspects of compliance are met\nProviding financial insights and analysis to support strategic decision-making\nContinuous improvement of financial policies, procedures, and controls\nEstablishing a project accounting function to assist the business in driving successful capital projects\nCollaborating with key stakeholders across the business to drive financial performance through operational efficiency"
  },
  {
    "createdAt": "Posted 3 months ago",
    "title": "Draftsperson",
    "location": "Auckland CBD, Auckland, New Zealand",
    "workStyle": "On-site",
    "workType": "",
    "url": "https://apply.workable.com/connexa/j/FD418F41A2/",
    "areas": "Operations",
    "description": "Description\n\nConnexa is an independent New Zealand mobile towers and passive infrastructure business, operating a nationwide portfolio of over 2350 mobile sites. Connexa’ s vision is to enable a more connected digital future for Aotearoa New Zealand.\n\nConnexa has an ambitious forward build programme, and this is an exciting opportunity to bring your Drafting skills from within the structural and civil space to the table, to play a part in the design of new passive mobile towers and infrastructure and the improvement of existing assets.\n\nAs a Draftsperson, you will be responsible for producing accurate and detailed technical drawings and documentation for our cell tower upgrades and new builds. You will work closely with the Structural Engineers, Deployment Engineers & Project Managers, as well as other stakeholders to ensure that drawings are produced to specifications and meet the required standards.\n\nThis role is based in our modern office in Auckland CBD, offering a social, fun, and inclusive working environment.\n\nResponsibilities include:\n\nProduce and amend CAD drawings and documentation for cell tower upgrades and new builds\nCollaborate with engineers, project managers, deployment engineers and other stakeholders to understand project requirements and specifications\nEnsure drawings are accurate, complete, and comply with relevant standards and regulations\nMaintain drawing records and documentation for projects\nAssist in the development and improvement of drafting processes and standards\nManage and prioritize multiple projects and deadlines"
  },
  {
    "createdAt": "Posted 4 months ago",
    "title": "Project Manager - Infrastructure",
    "location": "Auckland, Auckland, New Zealand",
    "workStyle": "On-site",
    "workType": "Full time",
    "url": "https://apply.workable.com/connexa/j/FE123E1795/",
    "areas": "Operations",
    "description": "Description\n\nDue to exponential growth & ambitious forward build programme, we are expanding our Operations team and looking for a number of driven Project Manager's with infrastructure or civil construction experience to join our dynamic team.\n\nAs a part of Connexa, you will contribute to the growth and development of New Zealand's mobile tower infrastructure to support the rollouts of 5G and future mobile technologies. With over 2,350 mobile sites across the nation, Connexa plays a crucial role in enabling our customers, including Spark and 2degrees, to provide exceptional coverage and services to end users, unlocking New Zealand's digital potential.\n\nAs the Project Manager, you will be responsible for overseeing multiple projects across New Zealand in a fast-paced environment. You will work closely with various stakeholders, including service providers, landlords and communities, to ensure the successful delivery of projects within budget and timeline constraints. This role offers an exciting opportunity for you to make your mark in a rapidly evolving segment of New Zealand's telecommunications industry.\n\nResponsibilities\n\nLead and manage civil infrastructure projects, ensuring their timely and cost-effective completion\nCollaborate with internal teams to develop comprehensive project plans, including scope, budget, and timeline\nLiaise with external stakeholders, such as landlords and community members, to obtain necessary permissions and address any concerns\nConduct site assessments and surveys to assess the feasibility of proposed projects\nManage contracts and negotiate with contractors to ensure high-quality workmanship\nOversee the construction and installation of mobile towers, adhering to relevant safety regulations and industry standards\nMonitor and control project budgets and expenditures to ensure financial objectives are met\nProvide regular project updates to the leadership team and stakeholders, highlighting any issues or risks that may impact project delivery"
  }
]